
  {
    "_id": "5943ee7793ba9d23195b73ff",
    "name": "ut occaecat ut",
    "price": 9091.5374,
    "skucode": 597089,
    "teaser": "Adipisicing sunt est ea anim nostrud veniam ea proident nulla occaecat. Mollit mollit laboris pariatur nisi nostrud dolore cupidatat do. Magna sint nulla sint officia sunt dolore anim id sint culpa aute aliqua. Dolore velit elit quis nostrud reprehenderit enim aliquip est et anim quis dolore do.\r\n",
    "productdetails": {
      "brand": "est irure nisi",
      "color": {
        "items": [
          "green",
          "green",
          "blue"
        ]
      },
      "description": "Adipisicing irure amet eiusmod proident ad deserunt duis tempor deserunt voluptate adipisicing enim. Exercitation laborum excepteur Lorem velit irure eiusmod ea. Nulla eiusmod commodo amet dolore reprehenderit sit Lorem cillum sunt duis. Nisi nostrud dolore elit proident labore eiusmod cupidatat. Nisi excepteur dolore Lorem reprehenderit irure aliquip aliqua et veniam ullamco.\r\nCupidatat deserunt in mollit deserunt ex sit minim amet minim voluptate sunt nostrud non. Elit ea in pariatur irure. Minim ut labore et cillum id ipsum adipisicing culpa. Laboris enim laboris dolore consectetur do consectetur ut sunt commodo pariatur Lorem sunt Lorem commodo. Dolor nisi officia excepteur mollit nulla cupidatat tempor adipisicing in anim tempor id proident.\r\nFugiat sint esse aliquip fugiat anim qui amet commodo dolor Lorem nostrud nostrud ullamco. Amet amet esse esse tempor sunt ex cupidatat. Ullamco nulla id qui do eiusmod nisi eu occaecat labore voluptate velit quis ad. Cupidatat do occaecat exercitation voluptate consequat. Quis sit aute non laboris aute aliquip duis dolor mollit culpa voluptate anim.\r\n",
      "season": {
        "items": [
          "Winter Collections",
          "Winter Collections",
          "Summer Collection"
        ]
      },
      "size": {
        "items": [
          "XL",
          "XXL"
        ]
      }
    }
  }
  {
    "_id": "5943ee779eb2001ad11a6689",
    "name": "eiusmod deserunt consequat",
    "price": 6680.8077,
    "skucode": 357554,
    "teaser": "Enim laboris cillum excepteur sit. Ex velit cillum do voluptate quis minim enim sunt enim dolor. Ullamco deserunt cillum consequat nisi quis. Ea ad laboris veniam non ea eu culpa eu ipsum reprehenderit dolore laborum. Nisi est nisi qui tempor dolor mollit.\r\n",
    "productdetails": {
      "brand": "laboris officia dolore",
      "color": {
        "items": [
          "green",
          "green",
          "green"
        ]
      },
      "description": "Ut est ex adipisicing anim elit proident. Consectetur eu nostrud consequat reprehenderit fugiat. Aliqua do sunt dolor ex qui sunt et exercitation ipsum ea tempor occaecat. Irure consequat pariatur velit proident. Reprehenderit non nisi magna cupidatat nulla amet enim labore elit sunt et. Quis esse sunt quis incididunt et dolor id in cillum. Consequat voluptate sit amet quis officia pariatur dolor ullamco elit in adipisicing incididunt.\r\nOccaecat eiusmod consequat duis labore adipisicing ullamco quis cupidatat. Nisi esse tempor non laboris deserunt laboris qui qui est laboris officia aliquip labore. Anim excepteur deserunt sit est duis elit anim pariatur irure irure adipisicing minim duis incididunt. Incididunt fugiat eiusmod enim eiusmod.\r\nTempor officia ipsum ex officia pariatur adipisicing aliqua qui aliqua deserunt Lorem elit in aliquip. Irure ut amet quis velit cillum dolor commodo ipsum voluptate fugiat. Aliqua ex proident dolore aute qui nisi. Id nisi anim aliqua ullamco amet ex veniam occaecat. Nulla labore cupidatat enim est consequat officia officia sint nostrud elit nisi. Do quis et incididunt eiusmod laborum dolore sit veniam velit officia.\r\n",
      "season": {
        "items": [
          "Summer Collection",
          "All Seasons",
          "Winter Collections"
        ]
      },
      "size": {
        "items": [
          "L",
          "S"
        ]
      }
    }
  }
  {
    "_id": "5943ee77770f5cadace9e737",
    "name": "Lorem cupidatat fugiat",
    "price": 9527.0196,
    "skucode": 181525,
    "teaser": "Et commodo laboris adipisicing fugiat ipsum ex deserunt ut sit est est elit consequat laboris. Nostrud et quis dolor adipisicing consequat commodo laborum. Velit dolore id in eu velit est adipisicing non amet sunt enim. Cillum fugiat culpa exercitation esse exercitation duis quis exercitation consequat non.\r\n",
    "productdetails": {
      "brand": "dolore officia ex",
      "color": {
        "items": [
          "brown",
          "blue",
          "blue"
        ]
      },
      "description": "Ipsum proident officia anim Lorem commodo. Laboris commodo nulla commodo eiusmod eu qui. Sint deserunt nisi enim ipsum ut ea laboris. Aliqua Lorem fugiat anim dolore pariatur dolore elit aliquip ipsum. Cillum ad cillum non consectetur nulla magna minim excepteur sint. Esse occaecat pariatur aute ipsum est dolore exercitation cupidatat anim. Aliquip ipsum Lorem incididunt ea cillum ut laborum qui ut.\r\nLaborum aliqua nostrud incididunt amet incididunt qui ea sint dolor. Cupidatat nisi sunt voluptate voluptate. Aute commodo sit ex esse consequat nulla dolore voluptate exercitation tempor pariatur exercitation. Eu sit labore qui ut aliqua pariatur amet ex consequat eu. Incididunt sunt sint qui fugiat.\r\nExcepteur anim est dolore consequat ad exercitation aliqua ad reprehenderit reprehenderit quis. Ad Lorem aute sint deserunt est irure duis sunt aliqua do labore. Reprehenderit consequat incididunt ea aliquip voluptate. Dolor cupidatat id anim ullamco esse nisi ea occaecat reprehenderit ipsum ex. Consequat velit adipisicing excepteur ad.\r\n",
      "season": {
        "items": [
          "Summer Collection",
          "Winter Collections",
          "Winter Collections"
        ]
      },
      "size": {
        "items": [
          "S",
          "L"
        ]
      }
    }
  }
  {
    "_id": "5943ee7762f0fa6badb39867",
    "name": "magna dolore sunt",
    "price": 9437.6324,
    "skucode": 414895,
    "teaser": "Magna ut proident sunt pariatur aute tempor ut amet anim Lorem. Consectetur qui laborum ad reprehenderit non sunt. Nulla consequat voluptate nostrud ea nulla. Qui consectetur non excepteur non qui sit voluptate ea ex veniam aliqua elit deserunt laboris. Occaecat dolore ut veniam consectetur. Exercitation ea ullamco dolor incididunt ea excepteur aliqua aliqua excepteur enim nulla. Cupidatat Lorem sit nostrud laborum labore ex eiusmod ea dolore.\r\n",
    "productdetails": {
      "brand": "consequat magna ut",
      "color": {
        "items": [
          "green",
          "brown",
          "blue"
        ]
      },
      "description": "Ad ut eu consequat ut sint voluptate. Irure pariatur voluptate laboris enim eiusmod. Deserunt do aliquip irure nostrud irure. Sit elit ullamco sit cupidatat exercitation laborum cillum laborum ut ad id veniam. Dolore tempor non eu non. Tempor consequat ullamco eu enim qui incididunt sit magna ut mollit aliqua ipsum anim. Pariatur mollit nostrud nostrud do tempor.\r\nTempor proident voluptate quis sint ipsum fugiat consequat anim commodo ullamco et proident velit est. Sunt dolore dolore proident id Lorem esse quis est sunt aliquip duis. Anim sunt velit fugiat veniam fugiat fugiat qui anim reprehenderit elit magna ex. Consectetur in sint aliqua dolor incididunt reprehenderit ex occaecat. Consectetur ullamco magna id sunt proident culpa proident Lorem eu qui magna nisi deserunt. Proident minim ut eiusmod ut ad pariatur veniam nostrud qui culpa magna fugiat cupidatat laboris.\r\nQuis pariatur sint cupidatat ex elit velit aliquip aliquip ex incididunt esse. Est labore eiusmod enim tempor velit voluptate consequat sit labore commodo. Cupidatat veniam laboris pariatur anim laboris culpa consectetur cillum.\r\n",
      "season": {
        "items": [
          "Summer Collection",
          "All Seasons",
          "All Seasons"
        ]
      },
      "size": {
        "items": [
          "M",
          "M"
        ]
      }
    }
  }
  {
    "_id": "5943ee777ba9886f07a77dbc",
    "name": "aliqua aliquip aliqua",
    "price": 927.4472,
    "skucode": 411960,
    "teaser": "Ut officia elit elit ex laborum aute ullamco dolore qui cillum fugiat. Ex et duis fugiat laboris culpa aute est. Consectetur cillum anim laboris esse culpa. Ullamco consequat minim ipsum et adipisicing excepteur qui. Dolore ex dolor dolor nisi qui qui excepteur qui culpa nostrud incididunt. Dolor ullamco veniam velit ipsum in voluptate. Ex aliquip exercitation incididunt aliqua.\r\n",
    "productdetails": {
      "brand": "nulla quis duis",
      "color": {
        "items": [
          "brown",
          "blue",
          "blue"
        ]
      },
      "description": "Occaecat sint amet minim duis culpa ullamco aliqua aliqua aliquip ad nulla. Occaecat nostrud reprehenderit excepteur labore exercitation ipsum adipisicing aute adipisicing mollit ut consectetur velit excepteur. Commodo elit velit id excepteur laboris aliquip laborum nisi cillum do.\r\nConsectetur occaecat incididunt duis deserunt aute nostrud elit in. Consectetur mollit sit consectetur reprehenderit ullamco tempor consectetur aliquip sunt eiusmod incididunt commodo nulla. Laborum ut adipisicing anim eiusmod ullamco elit est velit proident ea velit. Laboris sint commodo non dolore mollit. Amet ex exercitation dolore sunt labore nulla in pariatur dolore elit qui aliqua tempor.\r\nSint aute cupidatat sit deserunt. Ex ullamco dolor deserunt et. Occaecat cupidatat tempor id consectetur esse culpa.\r\n",
      "season": {
        "items": [
          "Winter Collections",
          "All Seasons",
          "Winter Collections"
        ]
      },
      "size": {
        "items": [
          "M",
          "XXL"
        ]
      }
    }
  }
  {
    "_id": "5943ee77b6353b5f3aa4696b",
    "name": "aliquip et exercitation",
    "price": 2994.1579,
    "skucode": 793650,
    "teaser": "In do excepteur in qui non. Dolore ad reprehenderit commodo esse sunt quis. Tempor quis occaecat elit velit incididunt. Cupidatat aliqua ut aliquip laborum occaecat nostrud sint duis ullamco. Cillum anim veniam incididunt Lorem sunt eu dolor enim. Lorem tempor magna est consequat duis laborum pariatur labore et non laborum tempor.\r\n",
    "productdetails": {
      "brand": "exercitation proident dolore",
      "color": {
        "items": [
          "green",
          "blue",
          "green"
        ]
      },
      "description": "Mollit aliquip aliquip labore id laborum proident excepteur. Occaecat laborum dolore adipisicing elit mollit aliquip magna anim culpa culpa proident. Sint deserunt fugiat id occaecat.\r\nLaboris cillum fugiat sit non consectetur et adipisicing do ex minim aute occaecat sit. Reprehenderit veniam laboris culpa eu. Non ut adipisicing elit nisi excepteur pariatur aute incididunt minim elit eiusmod commodo minim enim.\r\nNulla anim reprehenderit fugiat et aliquip nisi id qui. Nostrud labore tempor laborum et id nisi amet. Cillum Lorem anim elit labore exercitation do occaecat. Do officia culpa anim qui minim aliquip eu ea et anim consequat fugiat aute voluptate.\r\n",
      "season": {
        "items": [
          "Summer Collection",
          "Summer Collection",
          "All Seasons"
        ]
      },
      "size": {
        "items": [
          "M",
          "L"
        ]
      }
    }
  }
  {
    "_id": "5943ee777f76b5ddb34d718a",
    "name": "magna exercitation mollit",
    "price": 4792.1285,
    "skucode": 317682,
    "teaser": "Ipsum duis ullamco id fugiat officia nulla in exercitation non. Pariatur laboris non mollit laboris mollit. Cupidatat ut nostrud sint proident reprehenderit quis Lorem deserunt. Deserunt laborum esse cupidatat voluptate enim. Labore laborum nulla officia ullamco irure sit consectetur laboris quis aliquip. Officia esse mollit eu id sunt culpa incididunt. Do aute velit proident veniam eiusmod cupidatat fugiat voluptate non.\r\n",
    "productdetails": {
      "brand": "eu incididunt cillum",
      "color": {
        "items": [
          "brown",
          "green",
          "blue"
        ]
      },
      "description": "Sint sit amet exercitation anim commodo nostrud ad id fugiat esse. Aliqua nostrud adipisicing magna reprehenderit non dolore aliquip veniam Lorem sunt dolore voluptate. Minim magna cupidatat commodo reprehenderit officia ut officia velit laborum commodo culpa. Id officia nisi Lorem mollit. Laborum dolore duis aliqua aute ut ad occaecat velit est voluptate. Non ipsum commodo magna velit id non occaecat dolore magna aliqua duis incididunt laborum. Ad pariatur labore ex cupidatat dolore nulla ipsum in culpa.\r\nCillum sit id pariatur excepteur consectetur non eu. Duis excepteur enim nostrud culpa labore. Aliquip culpa consectetur magna id ea commodo culpa nulla laboris amet amet consectetur adipisicing. Id est magna labore anim est do occaecat mollit nulla commodo fugiat. Aute ea et duis esse do consequat cupidatat voluptate excepteur enim cillum duis tempor elit. Et eu Lorem cupidatat magna magna ad dolor consectetur laborum minim. Aliqua fugiat voluptate ullamco aliqua sunt consectetur velit nulla anim.\r\nMagna aute occaecat eu deserunt id occaecat ex aliqua ullamco. Id non laborum incididunt exercitation officia. Veniam sunt esse velit reprehenderit sunt dolore velit deserunt ex cillum consectetur. Consequat ipsum et et occaecat in incididunt. Eu deserunt non ad quis laboris nulla duis sunt eiusmod ipsum consequat laborum. Eu tempor culpa in incididunt aliqua.\r\n",
      "season": {
        "items": [
          "All Seasons",
          "Summer Collection",
          "Summer Collection"
        ]
      },
      "size": {
        "items": [
          "XXL",
          "S"
        ]
      }
    }
  }
  {
    "_id": "5943ee77221952c1882dcb7f",
    "name": "incididunt sunt excepteur",
    "price": 9151.6285,
    "skucode": 114231,
    "teaser": "Consequat duis veniam ea cillum labore minim. Consectetur fugiat aliqua laboris ullamco non do amet. Consectetur ipsum minim exercitation cillum in aliqua ea et proident magna excepteur adipisicing magna.\r\n",
    "productdetails": {
      "brand": "aliquip Lorem incididunt",
      "color": {
        "items": [
          "brown",
          "green",
          "green"
        ]
      },
      "description": "Consectetur adipisicing esse est ad excepteur enim amet duis labore eiusmod deserunt veniam. Ex aute laboris elit fugiat occaecat incididunt nostrud in nostrud ipsum. Ea deserunt sunt incididunt consectetur cupidatat ea occaecat ea aliqua laboris id qui. Magna reprehenderit deserunt do incididunt aliquip enim. Qui dolor ex consequat excepteur consequat ad aliquip ut est laborum irure laboris aliqua laboris. Et et occaecat est nostrud sit elit elit ullamco commodo laborum. Occaecat non nulla ad eiusmod voluptate sint in adipisicing sit elit exercitation veniam est voluptate.\r\nAdipisicing ipsum consectetur occaecat voluptate exercitation fugiat veniam fugiat consequat esse excepteur. Laboris fugiat est ex deserunt aliquip ea consequat id deserunt deserunt ad anim minim. Anim aliquip ad deserunt qui id est. Proident elit labore pariatur laboris sit voluptate pariatur qui eiusmod mollit duis proident est. Eu Lorem proident culpa exercitation occaecat est. Amet Lorem ullamco cupidatat Lorem.\r\nAd duis pariatur officia ea laboris aliqua. Laboris ullamco ad occaecat incididunt occaecat ad magna. Nostrud deserunt ullamco sint excepteur labore magna voluptate occaecat ipsum. Id ea nisi ipsum anim elit nisi reprehenderit id id cupidatat quis officia esse officia. Aliquip dolore occaecat in consequat mollit anim enim consectetur minim officia dolore. Do nulla aute officia ex in velit irure consectetur laboris sint minim amet minim.\r\n",
      "season": {
        "items": [
          "Summer Collection",
          "Summer Collection",
          "All Seasons"
        ]
      },
      "size": {
        "items": [
          "M",
          "L"
        ]
      }
    }
  }
  {
    "_id": "5943ee77a6331a6f73e64197",
    "name": "qui ad Lorem",
    "price": 8770.4739,
    "skucode": 228290,
    "teaser": "Veniam nulla cillum sunt fugiat. Pariatur mollit qui ipsum enim. Cillum eiusmod eiusmod et do nostrud excepteur fugiat. Ex dolor tempor duis Lorem in tempor occaecat Lorem do esse veniam. Sunt tempor excepteur esse irure eiusmod ad dolore magna ex do nulla. Ad exercitation excepteur in elit incididunt magna elit nisi.\r\n",
    "productdetails": {
      "brand": "consequat ad enim",
      "color": {
        "items": [
          "brown",
          "brown",
          "green"
        ]
      },
      "description": "Dolor non labore elit nulla excepteur fugiat nostrud sit adipisicing proident consequat incididunt. Ad pariatur deserunt minim consectetur id sint officia non ullamco ex. Sint dolore deserunt tempor occaecat nulla aute est minim incididunt incididunt proident. Ipsum anim duis proident Lorem excepteur aute voluptate exercitation Lorem do. Dolor cillum mollit sit tempor sunt exercitation. Excepteur incididunt magna ea incididunt amet non consectetur voluptate non ea commodo nostrud Lorem nostrud.\r\nCupidatat labore occaecat nostrud anim ex pariatur elit proident enim minim ipsum et est. Aute deserunt eiusmod consectetur cupidatat laborum laborum ullamco enim aliqua et excepteur fugiat. Non in aliqua sunt ut incididunt mollit duis duis laboris qui sunt sit nostrud. Ex sunt ut enim labore elit voluptate et est sint irure aliquip elit amet. Est in proident ipsum ullamco officia do in excepteur. Anim fugiat veniam occaecat occaecat occaecat ut irure non minim velit aliquip proident ullamco sint.\r\nQui minim officia aliqua elit occaecat in mollit non magna incididunt ipsum. Reprehenderit laborum occaecat nulla aute dolore incididunt. Veniam esse occaecat ipsum ut officia laborum enim sit ipsum aute amet nostrud sit cupidatat.\r\n",
      "season": {
        "items": [
          "All Seasons",
          "Summer Collection",
          "Summer Collection"
        ]
      },
      "size": {
        "items": [
          "L",
          "XXL"
        ]
      }
    }
  }
  {
    "_id": "5943ee77cf476c78e02afab8",
    "name": "cupidatat sunt voluptate",
    "price": 7493.8254,
    "skucode": 438005,
    "teaser": "Deserunt ullamco qui cillum cupidatat nulla do adipisicing esse est fugiat incididunt. Qui esse enim pariatur ut Lorem minim elit consequat officia nisi. Voluptate ex ex enim exercitation amet consequat mollit sit elit. Magna do labore occaecat id magna est non anim consequat nulla irure qui est irure.\r\n",
    "productdetails": {
      "brand": "aliqua et commodo",
      "color": {
        "items": [
          "blue",
          "green",
          "blue"
        ]
      },
      "description": "Esse ex irure sunt sit exercitation commodo elit. Mollit enim labore exercitation aliquip ipsum cupidatat aute nisi aute aute ipsum deserunt id dolor. Lorem ad dolor cupidatat elit tempor sunt est sit in voluptate eu deserunt. Anim commodo aliqua fugiat quis do mollit cillum laboris qui. Magna laborum non nisi sunt. Anim duis ut aliqua aliquip laborum.\r\nDo eu amet officia ut officia eiusmod magna dolore laboris in ullamco nostrud. Deserunt qui culpa irure ullamco velit. Dolore ut ut minim mollit excepteur. Ullamco nulla eiusmod cupidatat eu voluptate culpa ea laboris et nulla officia fugiat veniam culpa. Qui non excepteur nisi mollit in culpa reprehenderit. Aute irure qui irure quis occaecat et amet do.\r\nEsse irure quis est ad voluptate voluptate. Mollit laboris amet pariatur est ex aliqua id aliquip duis ad adipisicing. Aliquip proident labore culpa mollit tempor. Ea magna sint laboris culpa esse id. Aliqua occaecat aliquip dolor fugiat labore non. Deserunt nisi do enim enim sunt adipisicing nulla tempor aute ut excepteur.\r\n",
      "season": {
        "items": [
          "Summer Collection",
          "All Seasons",
          "All Seasons"
        ]
      },
      "size": {
        "items": [
          "S",
          "XL"
        ]
      }
    }
  }
